#include "workwithmass.h"
#include <QTime>

/****************************************
*   Конструктор класу WorkWithMass      *
****************************************/
WorkWithMass::WorkWithMass(int s)
{
    size = s;
    massive = new int[size];
}

/***************************************
*   Деструктор класу WorkWithMass      *
***************************************/
WorkWithMass::~WorkWithMass(){
    delete [] massive;
}

/******************************************************
*   Сетер, що встановлює значення розміру масиву      *
*параметри:                                           *
*   s - розмір масиву                                 *
*******************************************************/
void WorkWithMass::setSize(int s){
    size = s;
}

/************************************
*   Функція, яка створює масив      *
************************************/
void WorkWithMass::create_mass(){
    massive = new int[size];
}

/************************************
*   Функція, яка видаляє масив      *
************************************/
void WorkWithMass::delete_mass(){
    delete [] massive;
}

/****************************************
*   Функція, яка ініціалізує масив      *
****************************************/
void WorkWithMass::init_mass(){
    for (int i = 0; i < size; i++) {
        if (i == 0) massive[i] = rand() % 50+1;
        else massive[i] = massive[i - 1] + rand() % 50+1;
    }
}

/****************************************************
*   Гетер, що повертає значення розміру масиву      *
****************************************************/
int WorkWithMass::getSize(){
    return size;
}

/********************************************************
*   Гетер, що повертає елемент масиву, за індексом      *
*параметри:                                             *
*   і - індекс елемента                                 *
********************************************************/
int WorkWithMass::getElement(int i){
    return massive[i];
}
